rafael-872014d3/renode/resc/STM32U585.svd
          <register>
            <name>RCC_PLL2DIVR</name>
            <displayName>RCC_PLL2DIVR</displayName>
            <description>RCC PLL2 dividers configuration register</description>
            <addressOffset>0x03C</addressOffset>
            <size>0x20</size>
            <resetValue>0x01010280</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PLL2N</name>
                <description>Multiplication factor for PLL2 VCO
This bitfield is set and reset by software to control the multiplication factor of the VCO. It can be written only when the PLL is disabled (PLL2ON = 0 and PLL2RDY = 0).
... 
...
Others: reserved
VCO output frequency = F&lt;sub&gt;ref2_ck&lt;/sub&gt; x PLL2N, when fractional value 0 has been loaded in PLL2FRACN, with: 
PLL2N between 4 and 512
input frequency F&lt;sub&gt;ref2_ck&lt;/sub&gt; between 1MHz and 16MHz</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x003</name>
                    <description>PLL2N = 4</description>
                    <value>0x003</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x004</name>
                    <description>PLL2N = 5</description>
                    <value>0x004</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x005</name>
                    <description>PLL2N = 6</description>
                    <value>0x005</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x080</name>
                    <description>PLL2N = 129 (default after reset)</description>
                    <value>0x080</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1FF</name>
                    <description>PLL2N = 512</description>
                    <value>0x1FF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL2P</name>
                <description>PLL2 DIVP division factor
This bitfield is set and reset by software to control the frequency of the pll2_p_ck clock. It can be written only when the PLL2 is disabled (PLL2ON = 0 and PLL2RDY = 0).
...</description>
                <bitOffset>9</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_p_ck = vco2_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_p_ck = vco2_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll2_p_ck = vco2_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>pll2_p_ck = vco2_ck / 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll2_p_ck = vco2_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL2Q</name>
                <description>PLL2 DIVQ division factor
This bitfield is set and reset by software to control the frequency of the pll2_q_ck clock. It can be written only when the PLL2 is disabled (PLL2ON = 0 and PLL2RDY = 0).
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_q_ck = vco2_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_q_ck = vco2_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll2_q_ck = vco2_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>pll2_q_ck = vco2_ck / 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll2_q_ck = vco2_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL2R</name>
                <description>PLL2 DIVR division factor
This bitfield is set and reset by software to control the frequency of the pll2_r_ck clock. It can be written only when the PLL2 is disabled (PLL2ON = 0 and PLL2RDY = 0).
...</description>
                <bitOffset>24</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll2_r_ck = vco2_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll2_r_ck = vco2_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll2_r_ck = vco2_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>pll2_r_ck = vco2_ck / 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll2_r_ck = vco2_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL2FRACR</name>
            <displayName>RCC_PLL2FRACR</displayName>
            <description>RCC PLL2 fractional divider register</description>
            <addressOffset>0x040</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PLL2FRACN</name>
                <description>Fractional part of the multiplication factor for PLL2 VCO
This bitfield is set and reset by software to control the fractional part of the VCO multiplication factor. It can be written at any time, allowing dynamic fine-tuning of the PLL2 VCO.
VCO output frequency = F&lt;sub&gt;ref2_ck&lt;/sub&gt; x (PLL2N + (PLL2FRACN / 2&lt;sup&gt;13&lt;/sup&gt;)), with 
PLL2N must be between 4 and 512.
PLL2FRACN can be between 0 and 2&lt;sup&gt;13 &lt;/sup&gt;- 1.
The input frequency F&lt;sub&gt;ref2_ck&lt;/sub&gt; must be between 4 and 16 MHz.
In order to change the FRACN value on-the-fly even if the PLL is enabled, the application must proceed as follows:
Set the bit PLL2FRACEN to 0. 
Write the new fractional value into PLL2FRACN. 
Set the bit PLL2FRACEN to 1.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL3DIVR</name>
            <displayName>RCC_PLL3DIVR</displayName>
            <description>RCC PLL3 dividers configuration register</description>
            <addressOffset>0x044</addressOffset>
            <size>0x20</size>
            <resetValue>0x01010280</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PLL3N</name>
                <description>Multiplication factor for PLL3 VCO
This bitfield is set and reset by software to control the multiplication factor of the VCO. It can be written only when the PLL is disabled (PLL3ON = 0 and PLL3RDY = 0).
...
...
Others: reserved
VCO output frequency = F&lt;sub&gt;ref3_ck&lt;/sub&gt; x PLL3N, when fractional value 0 has been loaded in PLL3FRACN, with: 
PLL3N between 4 and 512
input frequency F&lt;sub&gt;ref3_ck&lt;/sub&gt; between 4 and 16MHz</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x003</name>
                    <description>PLL3N = 4</description>
                    <value>0x003</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x004</name>
                    <description>PLL3N = 5</description>
                    <value>0x004</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x005</name>
                    <description>PLL3N = 6</description>
                    <value>0x005</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x080</name>
                    <description>PLL3N = 129 (default after reset)</description>
                    <value>0x080</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1FF</name>
                    <description>PLL3N = 512</description>
                    <value>0x1FF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL3P</name>
                <description>PLL3 DIVP division factor
This bitfield is set and reset by software to control the frequency of the pll3_p_ck clock. It can be written only when the PLL3 is disabled (PLL3ON = 0 and PLL3RDY = 0).
...</description>
                <bitOffset>9</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll3_p_ck = vco3_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_p_ck = vco3_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll3_p_ck = vco3_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>pll3_p_ck = vco3_ck / 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll3_p_ck = vco3_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL3Q</name>
                <description>PLL3 DIVQ division factor
This bitfield is set and reset by software to control the frequency of the pll3_q_ck clock. It can be written only when the PLL3 is disabled (PLL3ON = 0 and PLL3RDY = 0).
...</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll3_q_ck = vco3_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_q_ck = vco3_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll3_q_ck = vco3_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>pll3_q_ck = vco3_ck / 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll3_q_ck = vco3_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLL3R</name>
                <description>PLL3 DIVR division factor
This bitfield is set and reset by software to control the frequency of the pll3_r_ck clock. It can be written only when the PLL3 is disabled (PLL3ON = 0 and PLL3RDY = 0).
...</description>
                <bitOffset>24</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>pll3_r_ck = vco3_ck</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>pll3_r_ck = vco3_ck / 2 (default after reset)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>pll3_r_ck = vco3_ck / 3</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>pll3_r_ck = vco3_ck / 4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x7F</name>
                    <description>pll3_r_ck = vco3_ck / 128</description>
                    <value>0x7F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RCC_PLL3FRACR</name>
            <displayName>RCC_PLL3FRACR</displayName>
            <description>RCC PLL3 fractional divider register</description>
            <addressOffset>0x048</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PLL3FRACN</name>
                <description>Fractional part of the multiplication factor for PLL3 VCO
This bitfield is set and reset by software to control the fractional part of the VCO multiplication factor. It can be written at any time, allowing dynamic fine-tuning of the PLL3 VCO.
VCO output frequency = F&lt;sub&gt;ref3_ck&lt;/sub&gt; x (PLL3N + (PLL3FRACN / 2&lt;sup&gt;13&lt;/sup&gt;)), with: 
PLL3N must be between 4 and 512.
PLL3FRACN can be between 0 and 2&lt;sup&gt;13 &lt;/sup&gt;- 1.
The input frequency F&lt;sub&gt;ref3_ck&lt;/sub&gt; must be between 4 and 16 MHz.
In order to change the FRACN value on-the-fly even if the PLL is enabled, the application must proceed as follows:
Set the bit PLL3FRACEN to 0. 
Write the new fractional value into PLL3FRACN. 
Set the bit PLL3FRACEN to 1.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
