rafael-872014d3/renode/resc/STM32U585.svd
        <register>
          <name>MDF_OEC3CR</name>
          <displayName>MDF_OEC3CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_OEC4CR</name>
          <displayName>MDF_OEC4CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_OEC5CR</name>
          <displayName>MDF_OEC5CR</displayName>
          <description>This register contains the offset compensation value.</description>
          <addressOffset>0x334</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Offset error compensation Set and cleared by software. If the application attempts to write a new offset value while the previous one is not yet applied, this new offset value is ignored. Reading back the OFFSET[25:0] field will inform the application on the current offset value. OFFSET[25:0] represents the value to be subtracted to the signal before going to the SCALE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS0DR</name>
          <displayName>MDF_SNPS0DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS1DR</name>
          <displayName>MDF_SNPS1DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS2DR</name>
          <displayName>MDF_SNPS2DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS3DR</name>
          <displayName>MDF_SNPS3DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS4DR</name>
          <displayName>MDF_SNPS4DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x2EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_SNPS5DR</name>
          <displayName>MDF_SNPS5DR</displayName>
          <description>This register is used to read the data processed by each digital filter in snapshot mode.</description>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>Contains the MCIC decimation counter value at the moment of the last trigger event occurs (MCIC_CNT)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size If SNPSFMT =  0 , EXTSDR[6:0] contains the bit 7 to 1 of the last valid data processed by the digital filter, If SNPSFMT =  1 , this field contains the INT accumulator counter value at the moment of the last trigger event occurs (INT_CNT).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Contains the 16 MSB of the last valid data processed by the digital filter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT0DR</name>
          <displayName>MDF_DFLT0DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT1DR</name>
          <displayName>MDF_DFLT1DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT2DR</name>
          <displayName>MDF_DFLT2DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT3DR</name>
          <displayName>MDF_DFLT3DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT4DR</name>
          <displayName>MDF_DFLT4DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0x2F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDF_DFLT5DR</name>
          <displayName>MDF_DFLT5DR</displayName>
          <description>This register is used to read the data processed by each digital filter.</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data processed by digital filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
